# -*- coding: utf-8 -*-

"""
프로그래밍이란 무엇인가?

프로그래밍은 일상에서 우리가 쓰는 문제해결 방법을 기계가 이해할 수 있게 해석해주는 것

예를들어 우리가 집을 나가 근처 편의점으로 간다고 생각해보자

1. 쭉 걷는 것을 "반복" 하다가

2. 어떤 코너가 나오"면" 돌고

3. 다시 걷는 것을 "반복"하는 것

혹은 계란후라이를 하는것을 생각해보자

냉장고 문을 열어서

1. 계란이 있다"면", 계란을 꺼낸다

2. 후라이팬을 꺼낸다

3. 카놀라유가 있는지 확인하고, 없으면, 콩기름을 붓는다

4. 후라이팬을 가열한다 ( 목표 온도에 도달할 때까지 온도를 높인다 )

5. 후라이팬에 계란을 넣는다

6. 5분간 익힌다, 시간이 다 될때까지 계속 뒤집는다

7. 만약 반숙을 먹고 싶다면, 3분만 익힌다

8 접시에 계란을 올린다

9. 먹는다


자, 이렇듯 모든 행동은 잘게 쪼게면 위와같이 나누어진다.

이 중 몇몇 구문과 단어에 주목해보자

우선, ~하면 과 반복이 자주 등장한다

그런 것들을 프로그래밍 에서는 if, for, while 등의 조건문과 반복문에 대응한다.

또한 계란, 후라이팬, 카놀라유, 접시 등은 프로그래밍의 변수 와 객체 에 해당한다.

꺼낸다, 넣는다, 확인하다, 익힌다 등은 프로그래밍의 함수에 대응한다.
각 함수는 다시 위와 같은 순서도로 쪼게질 수 있을 것이다.

위의 1~9 까지를 묶으면 "계란 후라이를 한다" 라는 함수로 크게 정의될 수 있는것과 비슷하다.

즉, 함수 = 묶음 이다


따라서, 코딩의 핵심은 아래 다섯 요소이다
조건문, 반복문, 변수, 객체, 함수 이다.

많은 프로그래머들은 실제로 조건문과 반복문만 가지고도 어떤 프로그램이든 만들 수 있다고 역설한다.




왜 파이썬인가?

프로그래밍 언어는 크게 저수준과 고수준 언어로 나뉜다.

저수준이냐 고수준 이냐는 언어가 우월하냐 열등하냐 와는 관련이 없고, 하드웨어 단과 얼마나 가깝냐와 관련

저수준일수록 메모리, cpu 등의 하드웨어를 직접적으로 다루며, 따라서 빠른 성능을 담보하지만 학습곡선이 높고 난해함

반면에 고수준 일수록 추상적으로(aka 단순하게) 하드웨어에 접근하며, 상대적으로 느리지만 쉬움


c++이나 c 등은 저수준 언어. 오래됨. 따라서 어렵고 난해. 포인터가 그 예시

파이썬은 대표적인 고수준 언어로서, 여러 복잡다단한 부분들이 간결화되어 프로그래머가 신경쓸 것이 적음. 초보자의 배움에 최적화


또한 파이썬은 수리 계산, 통계, 머신러닝, 웹, 학습 등 여러분야에 두루 쓸수 있어 범용성이 높음


자세한 이점
1. 파이썬은 인간다운 언어이

2. 문법이 쉽다

3. 무료이지만 강력

4. 간결

5. 프로그래밍에 집중

"Life is too short, You need python." (인생은 너무 짧으니 파이썬이 필요해.)






"""























































